# SegmentsStartIsGreaterThanSegmentsEnd Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ScheduleViewFailures..::..SegmentsStartIsGreaterThanSegmentsEnd Property
BuiltInFailures..::..ScheduleViewFailures Class See Also
---
Change values so Segments End is greater than or equal to Segments Start.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SegmentsStartIsGreaterThanSegmentsEnd { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SegmentsStartIsGreaterThanSegmentsEnd As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SegmentsStartIsGreaterThanSegmentsEnd {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ScheduleViewFailures Class
Autodesk.Revit.DB Namespace